Repository: TheTechRobo/Python_Text_Calculator
Catalog: locale/*/LC_MESSAGES/*.po
Languages: fr

source: What length is the side of the triangle?
fr: Longueur du côté de la triangle ?

source: The area is: %s
fr: La réponse est : %s

source: What length is the base of the triangle?
fr: Longeur de la base du triangle ?

source: What length is the height of the triangle?
fr: Hauteur du triangle ?

source: What is the length of the first side?
fr: longeur du premiere cote ?

source: what is the length of the second side?
fr: longeur du deuxieme cote ?

source: What is the length of the third side?
fr: Longeur du troisieme cote ?

source: The area is:
fr: La réponse est :

source: What is the length of the side of the square?
fr: Longeur du cote du carre ?

source: What is the length of the rectangle?
fr: Longeur du rectangle ?

source: What is the height of the rectangle?
fr: Hauteur du rectangle ?

source: What is the length of the base?
fr: Longeur de la base ?

source: What is the height of the shape?
fr: Hauteur du forme ?

source: What is the length of the first diagonal?
fr: Longeur du deuxieme diagonal ?

source: What is the length of the 2nd diagonal?
fr: Longeur de la 2eme diagonal ?

source: What is the length of the 1st set of parallel sides?
fr: Longeur de la 1ere set des cotes parallels ?

source: What is the length of the 2nd set of parallel sides?
fr: Longeur de la 2eme set des cotes parallels ?

source: What is the height of the trapezium?
fr: Hauteur du trapeze ?

source: What is the radius of the circle?
fr: Radius du cercle ?

source: What is the radius of the semicircle?
fr: Radius du demi-cercle ?

source: What is the radius of the circular sector?
fr: Radius du sector circulaire ?

source: What is the angle of the circular sector *in degrees*?
fr: Quel est l'angle du secteur circulaire * en degrés *?

source: What is the radius of the outer circle?
fr: C'est quoi le radius de la cercle exterieur ?

source: What is the radius of the inner circle?
fr: C'est quoi le radius de la cercle inneur ?

source: What is the length of the major axis?
fr: Longeur d'axis major ?

source: What is the length of the minor axis?
fr: Longeur de l'axis minor ?

source: Options: 1 - Equilateral triangle 2 - Right angle triangle 3 - Acute triangle 4 - Obtuse triangle 5 - Square 6 - Rectangle 8 - Parallelogram 9 - Rhombus 10 - Trapezium 11 - Circle 12 - Semicircle 13 - Circular sector 14 - Ring 15 - Ellipse
fr: Les options : 1 - Triangle equilateral 2 - Triangle avec une angle droite 3 - Triangle acute 4 - Triangle obtus 5 - Carre 6 - Rectangle 8 - Parallelogramme 9 - Losange 10 - Trapeze 11 - Cercle 12 - Demi-cercle 13 - Sectore circulaire 14 - Ring 15 - Ellipse

source: Please type one:
fr: SVP tappez une option :

source: Please type an integer
fr: SVP tappez une integer

source: I was too lazy to change 7.
fr: 7 n'existe pas !

source: Please enter the first number:
fr: Premiere numero ?

source: Please enter the second number:
fr: Deuxieme numero ?

source: That equals... %s
fr: La reponse est... %s

source: Do not divide by zero!
fr: Ne divisez pas par zéro !

source: There was an unknown issue dividing your Numbers...
fr: Il y avait un problème inconnu divisant vos numéros.

source: Number to be rooted?
fr: Quelle est la nombre ?

source: Press Control-C to stop.
fr: Appuyez sur Ctrl-C pour arrêter.

source: Thanks for using Palc's FIBONACCI function!
fr: Merci pour utiliser le fonction Fibonacci de Palc !

source: An error occured.
fr: Une erreur est survenue.

source: I think you want me to:
fr: Je pense que vous voulez que je :

source: y
fr: o

source: Is this correct? (Y/n)
fr: Est-ce-que c'est correct ? (O/n)

source: Try different wording. Or, if you want that calculation choice to be made right, file a ticket.
fr: Essayez un libellé différent. Ou, si vous voulez que ce choix de calcul soit fait correctement, déposez un billet.

source: Would you like to file a ticket? (Y/n) Type:
fr: Voulez-vous donner un billet? (Y/n) Tape:

source: Proceeding with the function I thought it was.
fr: En procédant à la fonction que je pensais qu’il était.

source: OK, proceeding with the function I thought it was.
fr: OK, en cours avec la fonction que je pensais que c’était.

source: Current list of commands: multiplication, division, addition, square, subtraction, modulo, area, volume, cube, exponents, root, logarithm, memory, interest calculator, fibonacci sequence, percentage calculator, convert temperature, and convert bases (aka number systems). Type quit to quit. Bugs? Head on over to https://github.com/thetechrobo/support/ To contribute: go to https://github.com/thetechrobo/python-text-calculator/
fr: Liste des calculs : multiplication, division, soustraction, addition, modulo, carré, aire, volume, cube, exponents, racines, fibonacci, ord, logarithme, mémoire, calculatrice pourcentage, calculatrice d'intérêt, température, et base (convertir les nombres au système différent). Tapez quitter pour quitter. Erreurs ? Allez a https://github.com/thetechrobo/support Si tu veux contribuer : https://github.com/thetechrobo/python-text-calculator (IMPORTANT : N'AJOUTE PAS LES ACCENTS AU CALCULS, OU CE NE VA PAS FONCTIONNER)

source: Type the first number (greater):
fr: Tappez le nombre premier (plus grand que la deuxieme) :

source: Type the second number (smaller):
fr: Tappez le 2eme numero (plus petit) :

source: Error!
fr: Une erreur est survenue.

source: Invalid input (code 1)
fr: Nombre invalid (code 1)

source: The second number entered is greater than the first number (code 2)
fr: Le nombre deuxieme est plus grand que la premiere nombre (code 2)

source: Type the original number:
fr: Tappez le nombre original :

source: Converting from a base to decimal (normal). Example bases: 2 - Binary 8 - Oct 16 - Hexadecimal Or, type 1 for ord. Type:
fr: Conversion d'une base en décimal (normal). Exemples de bases: 2 - Binaire 8 - Oct 16 - Hexadécimal Tapez 1 pour ord. Tappe :

source: Please enter the number to be converted from %s:
fr: Veuillez entrer le numéro pour être convertir de %s :

source: That equals... %s
fr: La reponse est... %s

source: TIP: If you got no answer, it might be that it was a Unicode character that it can't render. E.g. \x06 would just be a blank space, like so: 
fr: CONSEIL : si vous n'avez pas réussi une réponse, c'est probablement que ce soit une characteur Unicode que je ne peux pas rendre. Par exemple \x06 serait juste une espace vide, comme ceci : \x06

source: What base would you like to use? Currently supported: 10 (base 10), e (natural)
fr: Quelle système est-ce-que tu veux utiliser ? Options : 10 (décimal) ou e (naturel) Tape :

source: Using base 10
fr: utilisant base 10

source: What is the number?
fr: Quelle est la nombre ?

source: That equals:
fr: La réponse est...

source: Using natural logarithm
fr: Utilisant la logarithme naturel

source: The logarithm you typed is not available.
fr: La reponse est invalide.

source: Try again.
fr: Essaie encore.

source: This is the memory function. It will save a number into a file that can be used later with Palc... Or you can just read it with a text editor.
fr: Ceci est la fonction mémoire. Ce fonction va sauver une numéro en une fichier que peux être utiliser dans la futur avec Palc... Ou tu peux juste lire avec une éditeur texte.

source: Please enter the number to be saved:
fr: Quelle numero est-ce-que tu veux etre sauvé :

source: What slot would you like to use? (Hint: you can use any integer you want as long as you remember it) Type:
fr: Quelle slot memoire est-ce-que tu veux utiliser ? (Indice : tu peux utiliser n'importe quelle nombre si tu le souvient) Tappez :

source: This is the remember function. It will read a number that was previously stored in a file.
fr: Ca c'est le fonction lire memoire. Ca va lire une numero qui a ete sauve dans une fichier.

source: What slot number did you use?
fr: Quelle numero slot est-ce-que tu as utilise ?

source: Number: %s
fr: Numéro : %s

source: There was an error reading the file. Did you save the number by using the save function? Did you accidentally rename the file?
fr: Il y etait une erreur pour lire le fichier. Est-ce-que tu as sauve le numero ? est-ce-que tu as par accident renommer le fichier ?

source: Please do not type in a zero as the whole.
fr: N'écrivez pas une zero pour l'entier.

source: what is the ORIGINAL NUMBER?
fr: Quelle est le nombre original ?

source: What is the PERCENTAGE?
fr: Qu'est-ce que le POURCENTAGE ?

source: That equals...
fr: La reponse est...

source: What is the number that would be 100%?
fr: Quelle est la nombre qui serait 100 % ?

source: What is the number that you want to convert to percentage (e.g. this number out of the number that would be 100%)?
fr: Quel est le nombre que vous souhaitez convertir en pourcentage (par exemple, ce nombre sur le nombre qui serait 100%) ?

source: that equals:
fr: La reponse est...

source: What is the original number?
fr: Quelle est le nombre original ?

source: What is the rate of interest in percentage (without the percent sign)?
fr: Quel est le taux d'intérêt en pourcentage (sans le signe pourcentage)?

source: How many units of time would you like to calculate? Essentially, one unit of time could be one month, or one decade. It all depends on what you typed in the rate of interest question: it could be per year, per decade...we didn't ask. It was up to you to type the correct amount in the rate question. We have no idea what the rate represented: it could have been that rate per century for all we know. This calculator wasn't programmed with the ability to track time. So, with that out of the way, type the amount we should multiply the interest by (aka the amount of units of time). Type it:
fr: Combien des unités te temps est-ce-que tu veux calculer ? Une unité de temps peut être une mois, ou 10 ans. Il dépend tout sur quoi tu as tapez dans le taux de l'intérêt : ce pouvait représenter une mois, une année...on n'a pas demandé. C'était pour vous pour tapez le réponse correcte. On ne sais pas du tous quoi le taux a représenté : ce pouvait être cette taux par siècle pour tous qu'on savais. Cette calculatrice n'étais pas donne l'abilité pour savoir le temps. Donc, avec ça hors du chemin, tappe le montant que on dois multiplier l'intérêt par (aka le montant de unités de temps). Tappe le numero :

source: The answer is: %s
fr: La reponse est : %s

source: Would you like to do it again (Y/n)?
fr: Voulez-vous faire ça encore (O/n)?

source: Going back...
fr: Je retourne...

source: 1 - Ontario Sales Tax 2 - Quebec Sales Tax 3 - Yukon, Northwest Territories, Nunavut, and Alberta Sales Tax 4 - BC / Manitoba Sales Tax 5 - New Brunswick / Nova Scotia / Newfoundland / PEI Sales Tax 6 - Saskatchewan Sales Tax 7 - Custom Tax
fr: 1 - Taxe de vente de l'Ontario 2 - Taxe de vente du Québec 3 - Taxe de vente du Yukon, des Territoires du Nord-Ouest, du Nunavut et de l'Alberta 4 - Taxe de vente de la Colombie-Britannique / Manitoba 5 - Taxe de vente du Nouveau-Brunswick / Nouvelle-Écosse / Terre-Neuve / Î.-P.-É. 6 - Taxe de vente de la Saskatchewan 7 - Taxe personnalisée Choisissez-en une:

source: Choose one:
fr: Choisissez-en un :

source: What is the original price (before tax)?
fr: Quelle est le prix original (sans taxe) ?

source: After tax, the price is: %s
fr: Après qu'on ajoute taxe, le prix est : %s

source: OK, enter the original price:
fr: D'accord, tappez le prix original :

source: Now enter the tax percentage without the percent sign:
fr: Quel est le montant de taxe en pourcentage (sans le signe pourcentage)?

source: You did not type answer. Abort.
fr: Tu n'a pas tappez une reponse valide.

source: OPTIONS: 1 - Farenheit to Celsius 2 - Celsius to Farenheit 3 - Farenheit to Kelvin 4 - Celsius to Kelvin 5 - Kelvin to Celsius 6 - Kelvin to Farenheit Type:
fr: OPTIONS : 1 - Fahrenheit à Celsius 2 - Celsius à Fahrenheit 3 - Fahrenheit à Kelvin 4 - Celsius à Kelvin 5 - Kelvin à Celsius 6 - Kelvin à Fahrenheit Tappez une réponse :

source: Please enter the FAHRENHEIT temperature:
fr: Veuillez entrer la température FARENHEIT:

source: Please enter the CELSIUS temperature:
fr: Veuillez entrer la température CELSIUS:

source: Please enter the KELVIN temperature:
fr: Veuillez entrer la température KELVIN :

source: Invalid response.
fr: Réponse invalide.

source: I can't access the file func.py. This file is necessary for proper function of the Software.
fr: Je ne peux pas trouver le fichier func.py. Cette fichier est necessaire pour la fonction propre de cette logiciel.

source: I can't access file basicfunc.py. This file is necessary for proper function of the Software.
fr: Je ne peux pas trouver le fichier basicfunc.py. Cette fichier est nécessaire pour la fonction propre de cette logiciel.

source: Loading...............
fr: Chargement...

source: Press any key to continue...
fr: Appuyer sur une touche pour continuer…

source: What calculation do you wish to do? (Type `?' for a list of commands) Type:
fr: Quelle calculation est-ce-que tu veux faire? (Dit `?' pour une liste de calcules) Tappe :

source: help
fr: aide

source: tax
fr: taxe

source: calculate tax
fr: calculer la taxe

source: sq
fr: carre

source: square a number
fr: carré un nombre

source: Number to square?
fr: Quelle est la nombre ?

source: divide a number
fr: diviser un nombre

source: subtract a number from a number
fr: soustraire un nombre par un nombre

source: sub
fr: sous

source: add two numbers
fr: ajoute deux nombres

source: find the remainder of two numbers after division
fr: trouver le reste de deux numéros après la division

source: area
fr: aire

source: calculate area
fr: calcule l'aire

source: use the volume calculator
fr: utiliser la calculatrice volume

source: cube a number
fr: cube un nombre

source: Type the number to be cubed:
fr: Tappez le nombre à cuber :

source: quit
fr: quitter

source: exit
fr: quitter

source: multiply a number
fr: faire de la multiplication

source: use the exponent function
fr: utiliser la fonction exponent

source: Original number?
fr: Tappez le nombre original :

source: Exponent?
fr: Tappez l'exponent :

source: The " CUBE TWICE " feature was discontinued.
fr: La fonctionnalité << CUBE DEUX FOIS >> a été supprimée.

source: root
fr: racine

source: use the root function (opposite of exponents)
fr: utiliser la fonction racine (l'opposé d'exponents)

source: Square root or cube root? (square/cube) Type:
fr: Racine carré ou cubique ? (carre/cube, n'ajouter pas les accents) Tapez :

source: square
fr: carre

source: Number to be rooted?
fr: Quelle est la nombre pour << raciner >> ?

source: That equals.....
fr: La reponse est...

source: Currently I don't support the root you chose. Hopefully this will change :)
fr: Pour le moment je ne supporte pas la racine que vous voulez. J'espere que ca va changer :)

source: use the equals function (completely useless)
fr: utiliser la fonction qui est une gaspillage de temps total

source: Type in a number:
fr: Tappez le nombre :

source: =42 -- the answer to life, the universe, and everything
fr: =42 -- la reponse au vie, l'universe, et tous les choses

source: Do you really need a calculator for this?
fr: Est-ce-que tu as vraiment besoin d'une calculatrice pour ça ?

source: convert number systems
fr: convertir les systèmes numérique

source: ord a number
fr: 'ord' une nombre

source: Type in the number to ord:
fr: Tappez le nombre pour 'ord'er :

source: use the logarithm function
fr: utiliser la fonction logarithme

source: use the memory function
fr: utiliser la fonction mémoire

source: Would you like to set the memory or recall? (set / recall) Type:
fr: Souhaitez-vous setter la mémoire ou rappeler? (setter / rappeler) Type:

source: set
fr: setter

source: recall
fr: rappeler

source: You did not type an answer. Abort.
fr: Tu n'a pas tappez une reponse valide.

source: use the fibonacci calculator
fr: utiliser la fonction fibonacci

source: Starting fibonacci sequence. Please wait.
fr: Je commence le séquence Fibonacci. Veuillez attendre.

source: percent
fr: pourcent

source: use the percentage function
fr: utiliser la fonction pourcentage

source: 1 - Calculate "What is x% of y?" 2 - Convert a number to percentage. Type:
fr: 1 - Calcule << Quelle est x % de y ? >> 2 - Convertir une nombre au pourcentage. Tappez :

source: You didn't type a valid answer. Abort.
fr: Tu n'a pas tappez une reponse valide.

source: interest
fr: interet

source: use the interest calculator
fr: utiliser la calculatrice d'intérêt

source: use the temperature converter
fr: utiliser la converteur température

source: use the converter functions
fr: utiliser les converteurs

source: 1 - Convert temperature units Type:
fr: 1 - Convertir les unités de température Tape :

source: Type something!
fr: Tappez une chose !

source: I don't understand your request. Here are the currently supported calculations: multiplication, division, subtraction, addition, modulo, square, area, volume, cube, power, root, ord, fibonacci, logarithm, memory, percentage calculator, interest calculator, temperature, and base. Sorry for the inconvenience
fr: Je ne sais pas quoi vous voulez faire. Ça c'est une liste de les calcules supportes : multiplication, division, soustraction, addition, modulo, carré, aire, volume, cube, exponents, racines, fibonacci, ord, logarithme, mémoire, calculatrice pourcentage, calculatrice d'intérêt, température, et base. Désolé pour la dérangement : / (IMPORTANT : N'AJOUTE PAS LES ACCENTS AU CHOIX, OU CE NE VA PAS FONCTIONNER)

source: Welcome to Palc!
fr: Bienvenue au Palc !

source: Note that you CAN type `quit' instead of pressing the interrupt key
fr: Tu peux tappez `quitter' plutot que ^C...

source: Why ^D? Why not just type `quit'?
fr: Pourquoi ^D ? Pourquoi pas juste `quitter' ?

source: aERROR!
fr: aErreure !

source: You typed in an invalid integer or float. Or maybe the program needs debugging. Either way, it's a pretty big error.
fr: Erreure: Tu as tappez une nombre invalide, ou le logiciel a une probleme.

source: Details are in the log.
fr: Les détails sont dans le journal.

source: Looks like you exited.
fr: Tu as quitter Palc.

source: Unknown Error!
fr: Une erreure a survenue.

source: An unknown error occured. Please file an Issue at github.com/thetechrobo/support.
fr: Une erreur à se passé. Veuillez mettre une Issue à github.com/thetechrobo/support.

source: What length is the side of the cube?
fr: Quelle est le longeur de la cote du cube ?

source: The volume is: %s
fr: La reponse est : %s

source: What length is the breadth of the cuboid?
fr: Largeur du parallélépipède rectangle ?

source: What length is the height of the cuboid?
fr: Hauteur du parallélépipède rectangle ?

source: What length is the cuboid?
fr: Longeur du parallélépipède rectangle ?

source: What is the radius of the cylinder?
fr: Radius du cylindre ?

source: what is the height of the cylinder?
fr: Hauteur du cylindre ?

source: What is the radius of the hollow space?
fr: Radius d'espace creux ?

source: What is the height of the cylinder?
fr: Hauteur du cylindre ?

source: What is the radius of the cone?
fr: Radius du cone ?

source: What is the height of the cone?
fr: Hauteur du cone ?

source: What is the radius of the sphere?
fr: Radius du sphère ?

source: What is the length of the side of the base?
fr: Longueur de la côté du base ?

source: What is the height of the prism?
fr: Hauteur du prisme ?

source: What is the height of the pyramid?
fr: Hauteur du pyramide ?

source: Options: 1 - Cube 2 - Cuboid 3 - Cylinder 4 - Hollow cylinder 5 - Cone 6 - Sphere 8 - Hollow sphere 9 - Triangular prism 10 - Pentagonal prism 11 - Hexagonal prism 12 - Square-based pyramid 13 - Triangular pyramid 14 - Pentagon-based pyramid 15 - Hexagon-based pyramid
fr: Options: 1 - Cube 2 - Parallélépipède 3 - Cylindre 4 - Cylindre creux 5 - Cone 6 - Sphere 8 - Sphere creux 9 - Prisme triangulaire 10 - Prisme pentagonal 11 - Prisme hexagonal 12 - Pyramide a base carre 13 - Pyramide a base triangulaire 14 - Pyramide a base pentagonal 15 - Pyramide a base hexagonal
