Repository: TheTechRobo/Python_Text_Calculator
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: I can't access the file parsefunc.py. This file is necessary for proper function of the Software.
fr: Impossible d'accéder au fichier parsefunc.py. Ce fichier est nécessaire pour le bon fonctionnement du logiciel.

source: Unexpected error!
fr: Une erreur est survenue !

source: Press any key to continue...
fr: Appuyer sur une touche pour continuer…

source: What calculation do you wish to do? (Type `?' for a list of commands) Type:
fr: Quel calcul souhaitez-vous effectuer? (Saisissez `?' pour afficher la liste des calculs) Saisie :

source: help
fr: aide

source: tax
fr: taxe

source: calculate tax
fr: calculer une taxe

source: sq
fr: carre

source: square a number
fr: élever un nombre au carré

source: Number to square?
fr: Nombre à mettre au carré?

source: divide a number
fr: diviser un nombre

source: subtract a number from a number
fr: soustraire un nombre par un nombre

source: sub
fr: sous

source: add two numbers
fr: additionne deux nombres

source: 1 - Find the remainder of two numbers after division 2 - Use the percentage calculator. Anything else - Back to menu.
fr: 1 - Calculer le reste de deux numéros après la division (le modulo) 2 - Utiliser la calculatrice pourcentage Autre chose - Retour au menu.

source: Type:
fr: Saisissez :

source: going back.
fr: retour au menu...

source: find the remainder of two numbers after division
fr: trouver le reste de deux numéros après la division

source: area
fr: aire

source: calculate area
fr: calculer une aire

source: use the volume calculator
fr: utiliser la calculatrice volume

source: cube a number
fr: élever un nombre au cube

source: Type the number to be cubed:
fr: Saisissez le nombre à mettre au cube :

source: quit
fr: quitter

source: exit
fr: quitter

source: use the exponent function
fr: utiliser la fonction exposant

source: multiply a number
fr: multiplier un nombre

source: The "cube twice" feature was discontinued as it was pointless. Sorry for the inconvenience.
fr: La fonction << cube deux fois >> a été supprimé car c'est bête. Désolé.

source: root
fr: racine

source: use the root function (opposite of exponents)
fr: utiliser la fonction racine (opposé d'exposant)

source: Square root or cube root? (square/cube) Type:
fr: Racine carré ou cubique ? (carre/cube, n'ajouter pas les accents) Saisie :

source: square
fr: carre

source: Currently I don't support the root you chose. Hopefully this will change :D
fr: Pour le moment je ne supporte pas la racine que vous voulez. J'espère que ça va changer :D

source: use the equals function (completely useless)
fr: utiliser la fonction égale (complètement inutile)

source: Type in a number:
fr: Saisissez un nombre :

source: =42 -- the answer to life, the universe, and everything
fr: =42 -- la réponse de la grande question sur la vie, l'univers et le reste

source: Calculating...
fr: Calculation en progres...

source: ERROR: Too big of a number, timed out!
fr: ERREURE : Trop grand, il prend trop du temps !

source: convert number systems
fr: convertir les systèmes de bases numérique

source: ord a character
fr: "ord" un caractère

source: Type in the character to ord:
fr: Saisissez le caractère à 'ord' :

source: The result is: %s
fr: La résultat est : %s

source: use the logarithm function
fr: utiliser la fonction logarithme

source: use the memory function
fr: utiliser la fonction mémoire

source: Would you like to set the memory or recall? (set / recall) Type:
fr: Souhaitez-vous écrire ou lire la mémoire? (ecrire / lire, n'ajouter pas les accents) Saisie :

source: set
fr: ecrire

source: recall
fr: lire

source: You did not type an answer. Abort.
fr: Vous n'avez pas saisi une réponse valide. Annulation.

source: use the fibonacci calculator
fr: utiliser la fonction fibonacci

source: Starting fibonacci sequence. Please wait.
fr: Démarrage de la séquence Fibonacci. Veuillez patienter.

source: percent
fr: pourcent

source: use the percentage function
fr: utiliser la fonction pourcentage

source: interest
fr: interet

source: use the interest calculator
fr: utiliser le calculateur d'intérêt

source: use the temperature converter
fr: utiliser le convertisseur de température

source: use the converter functions
fr: utiliser les convertisseurs

source: 1 - Convert temperature units 2 - Convert bits and bytes and kilobytes and mebibytes and stuff Type:
fr: 1 - Convertir les unités de température 2 - Convertir les unités de stockage d'ordi Tapez ton réponse :

source: Not developed yet, but maybe soon! :D
fr: Pas developpe, mais peut-etre une jour... :D

source: I can't heeeeaaaarrrrrr yooooouuuuuuuu
fr: Je ne peux pas enteeeeennnnndre toiiiiiii

source: You speak quietly
fr: Tu parles doux

source: I can't heeeaaaarrrrr youuuuuuuu
fr: Je ne peux pas enteeeeennnnndre toiiiiiii

source: I don't understand your request. Here are the currently supported calculations: multiplication, division, subtraction, addition, modulo, square, area, volume, cube, power, root, ord, fibonacci, logarithm, memory, percentage calculator, interest calculator, temperature, and base. Sorry for the inconvenience
fr: Je ne sais pas ce que vous voulez faire. Voici une liste des calculs supportés : multiplication, division, soustraction, addition, modulo, carré, aire, volume, cube, exponents, racines, fibonacci, ord, logarithme, mémoire, calculatrice pourcentage, calculatrice d'intérêt, température, et base. Désolé pour le dérangement : / (IMPORTANT : N'AJOUTEZ PAS LES ACCENTS AUX COMMANDES, AUTREMENT CELA NE FONCTIONNERA PAS)

source: Welcome to Palc!
fr: Bienvenue dans Palc !

source: Note that you CAN type `quit' instead of pressing the interrupt key
fr: Vous pouvez saisir `quitter' plutôt que ^C...

source: Why ^D? Why not just type `quit'?
fr: Pourquoi ^D ? Pourquoi pas juste `quitter' ?

source: aERROR!a
fr: aERREUR !a

source: You typed in an invalid integer or float. Or maybe the program needs debugging. Either way, it's a pretty big error.
fr: Soit vous avez entré un nombre invalide, soit le logiciel a besoin d'être débogué. En tout cas, il s'agit d'une une erreur importante.

source: Looks like you exited.
fr: Vous quittez Palc.

source: aUnknown Error!a
fr: aErreur inconnue !a

source: An unknown error occured. Please file an Issue at github.com/thetechrobo/python-text-calculator/issues.
fr: Une erreur s'est produite. Veuillez soumettre un billet sur github.com/thetechrobo/python-text-calculator/issues.

source: Please enter the first number:
fr: Premier nombre ?

source: Please enter the second number:
fr: Deuxième nombre ?

source: ERRID 3: One or more of your numbers was not a number.
fr: Erreure id 3: Un ou plus de tes nombres n'etais pas un nombre.

source: ERRID3: One or more of the two numbers was not a number. (Dump: n1=%s, n2=%s)
fr: Erreure id 3: Un ou plus de tes nombres n'etais pas un nombre. (Dump: n1=%s, n2=%s)

source: An exception was raised! ValueError
fr: Une erreur a se passe ! ValueError

source: The response is...%s
fr: La résultat est...%s

source: That equals... %s
fr: La résultat est... %s

source: Number to be rooted?
fr: Nombre ?

source: ERRID3: One or more of the numbers was not a number. (Dump: n1=%s, n2=%s)
fr: Erreure id 3: Un ou plus de tes nombres n'etais pas un nombre. (Dump: n1=%s, n2=%s)

source: The answer is... %s
fr: Le résultat est ... %s

source: Enter the original number:
fr: Saisissez le nombre d'origine :

source: Enter the exponent:
fr: Saisissez l'exposant :

source: ERRID3: One or more of the numbers was not a number. (Dump: origin=%s, ex=%s)
fr: Erreure id 3: Un ou plus de tes nombres n'etais pas un nombre. (Dump: origin=%s, ex=%s)

source: Number to be rooted?
fr: Nombre dont vous souhaitez obtenir la racine ?

source: That equals... %s
fr: Le résultat est ... %s

source: Current list of commands: multiplication, division, addition, square, subtraction, modulo, area, volume, cube, exponents, root, logarithm, memory, interest calculator, fibonacci sequence, percentage calculator, convert temperature, "ord'ing", and convert bases (aka number systems). Type quit to quit. Bugs? Head on over to https://github.com/thetechrobo/python-text-calculator/ To contribute: go to https://github.com/thetechrobo/python-text-calculator/
fr: Liste des commandes : multiplication, division, soustraction, addition, modulo, carré, aire, volume, cube, exponents, racines, fibonacci, ord, logarithme, mémoire, calculatrice pourcentage, calculatrice d'intérêt, température, et base (convertir les nombres entre différentes bases). Tapez quitter pour quitter. Bugs ? Rendez-vous sur https://github.com/thetechrobo/python-text-calculator Si vous souhaitez contribuer : https://github.com/thetechrobo/python-text-calculator (IMPORTANT : N'AJOUTEZ PAS LES ACCENTS AUX COMMANDES, AUTREMENT CELA NE FONCTIONNERA PAS)

source: Would you like... 1 - Calculate a fixed amount of fibonacci numbers. 2 - Calculate fibonacci indefinitely. Type:
fr: Est-ce-que tu veux ... 1 - Calculer une montant fixe du fibonacci. 2 - Calculer fibonacci au infinite Tapez :

source: Fixed it is.
fr: J'utilise fixe.

source: How many numbers of fibonacci would you like to calculate?
fr: Quel est le montant des nombres de fibonacci que tu veux calculer ?

source: Your fibonacci numbers were...
fr: Tes nombres de fibonacci a ete...

source: Looped it is.
fr: J'utilise infinite.

source: Press Control-C to stop.
fr: Appuyez sur Ctrl-C pour arrêter.

source: An error occured.
fr: Une erreur est survenue.

source: I think you want me to: %s
fr: Je pense que vous voulez que je : %s

source: Is this correct? (Y/n)
fr: Est-ce correct ? (O/n)

source: y
fr: o

source: Try different wording. Or, if you want that calculation choice to be made right, file a ticket.
fr: Essayez un libellé différent. Ou, si vous voulez que ce choix de calcul soit implémenté, soumettez un billet.

source: Would you like to file a ticket? (Y/n) Type:
fr: Souhaitez-vous soumettre un billet? (O/n) Saisie :

source: Press ENTER to continue...
fr: Pousse ENTER pour continuer...

source: Proceeding with the function I thought it was.
fr: Utilisation de la fonction initialement détectée.

source: OK, proceeding with the function I thought it was.
fr: Ok, utilisation de la fonction initialement détectée.

source: Defaulting to yes.
fr: Par défaut à oui.

source: Please enter the original temperature...
fr: Veuillez entrer la température originale ...

source: destination
fr: déstination

source: Invalid input(s).
fr: Saisie(s) invalide(s).

source: That equals... %s
fr: La résultat est... %s

source: What is the ORIGINAL NUMBER?
fr: Quel est le nombre d'origine ?

source: What is the PERCENTAGE?
fr: Quel est le POURCENTAGE ?

source: That equals...
fr: Le résultat est...

source: You requested an impossible situation by entering 0 there - that would require division by 0.
fr: Tu as requêté une situation impossible par l'entrée de 0 là - il devait requis la division par 0.

source: What is the number that would be 100%?
fr: Quelle est le nombre qui serait 100 % ?

source: What is the number that you want to convert to percentage (i.e. this number out of the number that would be 100%)?
fr: Quel est le nombre que vous souhaitez convertir en pourcentage (i.e., ce nombre sur le nombre qui serait 100%) ?

source: 1 - Calculate "What is x% of y?" 2 - Convert a number to percentage (i.e. how much percent of ___ is ___?). Type:
fr: 1 - Calculer "Combien font x % de y ?" 2 - Convertir un nombre en pourcentage (i.e. combien pourcent de __ est __?). Saisie :

source: You didn't type a valid answer. Abort.
fr: Vous n'avez pas saisi une réponse valide. Annulation.

source: 1 - Ontario Sales Tax 2 - Quebec Sales Tax 3 - Yukon, Northwest Territories, Nunavut, and Alberta Sales Tax 4 - BC / Manitoba Sales Tax 5 - New Brunswick / Nova Scotia / Newfoundland / PEI Sales Tax 6 - Saskatchewan Sales Tax 7 - Custom Tax
fr: 1 - Taxe de vente de l'Ontario 2 - Taxe de vente du Québec 3 - Taxe de vente du Yukon, des Territoires du Nord-Ouest, du Nunavut et de l'Alberta 4 - Taxe de vente de la Colombie-Britannique / Manitoba 5 - Taxe de vente du Nouveau-Brunswick / Nouvelle-Écosse / Terre-Neuve / Î.-P.-É. 6 - Taxe de vente de la Saskatchewan 7 - Taxe personnalisée

source: Choose one:
fr: Choisissez-en une :

source: Please enter the tax percentage without the percent sign:
fr: Saisissez le montant de la taxe en pourcentage (sans le signe pourcentage) :

source: You did not type answer. Abort.
fr: Vous n'avez pas saisi une réponse valide.

source: What is the original price (before tax)?
fr: Quelle est le prix d'origine (hors taxe) ?

source: After tax, the price is: %s
fr: Après ajout de la taxe, le prix est : %s

source: 1 - Base 10 2 - Natural (e) logarithm Pick one:
fr: 1 - Logarithme à base 10 2 - Logatithme naturel (e) Tapez ton sélection :

source: What is the number?
fr: Quel est le nombre ?

source: The result is... %s
fr: Le résultat est... %s

source: The logarithm you typed is not available.
fr: Le logarithme que vous avez sélectionné n'est pas disponible.

source: Try again.
fr: Essayez encore.

source: Please wait a moment.
fr: Veuillez attendre une seconde.

source: Please enter the original base. HINT: Base 2 is binary, base 8 is octal, base 10 is decimal (normal), and base 16 is hex.
fr: Veuillez entrer la base original. NOTE : Base 2 est binaire, base 8 est octale, base 10 est décimale (normale), et base 16 est hexadécimale.

source: Enter your choice:
fr: Veuillez entrez ton sélection :

source: Please enter the destination base. Again, base 2 is binary, 8 is octal, 10 is normal, and 16 is hex.
fr: Veuillez entrer la base déstination. Encore, base 2 est binaire, 8 est octale, 10 est normale, et 16 est hexadécimale.

source: Please enter your original number - it should not have a decimal point.
fr: Veuillez entrez ton nombre original sans le point décimale.

source: Your number was messed up, or maybe Palc screwed it up, or maybe python-radix is buggy. Make sure that you didn't include things like `0b' forbinary calculation. So instead of `0b100111' being your input, try `100111' instead.
fr: Sois ta nombre a été floue, sois Palc a un bug, sois python-radix a un bug. Fais certain que tu n'a pas inclure les choses comme `0b' pour e.g. la calculation binaire. Donc plutôt que `0b100111', essayer `100111'.

source: This is the remember function. It will read a number that was previously stored in a file.
fr: Il s'agit de la fonction de lecture de la mémoire. Elle permet de lire un nombre qui a été enregistré dans un fichier.

source: What slot number did you use?
fr: Quel est le numéro de l'emplacement mémoire que vous souhaitez lire ?

source: Number: %s
fr: Nombre : %s

source: There was an error reading the file. Did you save the number by using the save function? Did you accidentally rename the file? Do you have the correct permissions?
fr: Une erreur a survenu lors de la lecture du fichier. Avez-vous sauvegardé le nombre avec la fonction mémoire ? Avez-vous renommé par accident le fichier ? Est-ce-que tu as les permissions correctes ?

source: This is the memory function. It will save a number into a file that can be used later with Palc... Or you can just read it with a text editor.
fr: Il s'agit de la fonction mémoire. Elle va enregistrer un nombre dans un fichier pour être utilisé plus tard avec Palc ou simplement lu avec un éditeur de texte.

source: Please enter the number to be saved:
fr: Saisissez le nombre à enregistrer :

source: What slot would you like to use? (Hint: you can use any integer you want as long as you remember it) Type:
fr: Quel emplacement mémoire souhaitez-vous utiliser ? (Vous pouvez utiliser n'importe quel nombre entier tant que vous vous en souvenez) Saisie :

source: What is the original number?
fr: Quel est le nombre d'origine ?

source: What is the rate of interest in percentage (without the percent sign)?
fr: Quel est le taux d'intérêt en pourcentage (sans le signe pourcentage) ?

source: How many units of time would you like to calculate? Essentially, one unit of time could be one month, or one decade. It all depends on what you typed in the rate of interest question: it could be per year, per decade...we didn't ask. It was up to you to type the correct amount in the rate question. We have no idea what the rate represented: it could have been that rate per century for all we know. This calculator wasn't programmed with the ability to track time. So, with that out of the way, type the amount we should multiply the interest by (aka the amount of units of time). Type it:
fr: Combien d'unités de temps souhaitez-vous calculer ? Une unité de temps peut être un mois, ou 10 ans. Cela dépend de ce que vous avez saisi comme taux de l'intérêt : il peut être mensuel, annuel... Nous n'avons pas demandé. C'était à vous de saisir le taux adéquat. Nous ignorons la périodicité de ce taux : ça pourrait même être un taux par siècle. Cette calculatrice n'a pas été programmée avec la fonctionnalité de mesurer le temps. Suite à ces précisions, saisissez la durée pendant laquelle appliquer l'intérêt (le nombre d'unités de temps). Saisie :

source: The answer is: %s
fr: Le résultat est : %s

source: Would you like to do it again (Y/n)?
fr: Souhaitez-vous exécuter de nouveau cette fonction (O/n)?

source: Going back...
fr: Retour au menu...

source: What length is the side of the triangle?
fr: Longueur du côté du triangle ?

source: The area is: %s
fr: L'aire est : %s

source: What length is the base of the triangle?
fr: Longueur de la base du triangle ?

source: What length is the height of the triangle?
fr: Hauteur du triangle ?

source: What is the length of the first side?
fr: Longueur du premier côté ?

source: what is the length of the second side?
fr: longueur du second côté ?

source: What is the length of the third side?
fr: Longueur du troisième côté ?

source: What is the length of the second side?
fr: Quel est le longueur du second côté ?

source: What is the length of the side of the square?
fr: Longueur du côté du carré ?

source: What is the length of the rectangle?
fr: Longueur du rectangle ?

source: What is the height of the rectangle?
fr: Hauteur du rectangle ?

source: What is the length of the base?
fr: Longueur de la base ?

source: What is the height of the shape?
fr: Hauteur de la forme ?

source: What is the length of the first diagonal?
fr: Longueur de la première diagonale ?

source: What is the length of the 2nd diagonal?
fr: Longueur de la seconde diagonale ?

source: What is the length of the 1st set of parallel sides?
fr: Longueur de la première paire de côtés parallèles ?

source: What is the length of the 2nd set of parallel sides?
fr: Longueur de la seconde paire de côtés parallèles ?

source: What is the height of the trapezium?
fr: Hauteur du trapèze ?

source: What is the radius of the circle?
fr: Rayon du cercle ?

source: What is the radius of the semicircle?
fr: Rayon du demi-cercle ?

source: What is the radius of the circular sector?
fr: Rayon du secteur circulaire ?

source: What is the angle of the circular sector *in degrees*?
fr: Quel est l'angle du secteur circulaire *en degrés* ?

source: What is the radius of the outer circle?
fr: Rayon du cercle extérieur ?

source: What is the radius of the inner circle?
fr: Rayon du cercle intérieur ?

source: What is the length of the major axis?
fr: Longueur de l'axe principal ?

source: What is the length of the minor axis?
fr: Longueur de l'axe secondaire ?

source: Options: 1 - Equilateral triangle 2 - Right angle triangle 3 - Acute triangle 4 - Obtuse triangle 5 - Square 6 - Rectangle 8 - Parallelogram 9 - Rhombus 10 - Trapezium 11 - Circle 12 - Semicircle 13 - Circular sector 14 - Ring 15 - Ellipse
fr: Options : 1 - Triangle équilatéral 2 - Triangle rectangle 3 - Triangle aigu 4 - Triangle obtu 5 - Carré 6 - Rectangle 8 - Parallélogramme 9 - Losange 10 - Trapèze 11 - Cercle 12 - Demi-cercle 13 - Secteur circulaire 14 - Anneau 15 - Ellipse

source: Please type one:
fr: Choisissez une option :

source: Please type an integer
fr: Merci d'entrer un nombre entier

source: I was too lazy to change 7.
fr: J’étais trop paresseux pour changer 7.

source: What length is the side of the cube?
fr: Quelle est le longueur de l'arrête du cube ?

source: The volume is: %s
fr: Le volume est : %s

source: What length is the breadth of the cuboid?
fr: Largeur du parallélépipède rectangle ?

source: What length is the height of the cuboid?
fr: Hauteur du parallélépipède rectangle ?

source: What length is the cuboid?
fr: Longueur du parallélépipède rectangle ?

source: What is the radius of the cylinder?
fr: Rayon du cylindre ?

source: What is the height of the cylinder?
fr: Hauteur du cylindre ?

source: What is the radius of the hollow space?
fr: Rayon de l'espace creux ?

source: What is the radius of the cone?
fr: Rayon du cône ?

source: What is the height of the cone?
fr: Hauteur du cône ?

source: What is the radius of the sphere?
fr: Rayon de la sphère ?

source: What is the length of the side of the base?
fr: Longueur du côté de la base ?

source: What is the height of the prism?
fr: Hauteur du prisme ?

source: What is the length of the side of the hexagon?
fr: Longueur du côté de l'hexagone ?

source: What is the height of the pyramid?
fr: Hauteur de la pyramide ?

source: Options: 1 - Cube 2 - Cuboid 3 - Cylinder 4 - Hollow cylinder 5 - Cone 6 - Sphere 8 - Hollow sphere 9 - Triangular prism 10 - Pentagonal prism 11 - Hexagonal prism 12 - Square-based pyramid 13 - Triangular pyramid 14 - Pentagon-based pyramid 15 - Hexagon-based pyramid
fr: Options: 1 - Cube 2 - Parallélépipède 3 - Cylindre 4 - Cylindre creux 5 - Cône 6 - Sphère 8 - Sphère creuse 9 - Prisme triangulaire 10 - Prisme pentagonal 11 - Prisme hexagonal 12 - Pyramide a base carre 13 - Pyramide a base triangulaire 14 - Pyramide a base pentagonale 15 - Pyramide a base hexagonale
